Revit 2026 API

# FieldValues(IListValueAtPoint) Constructor

---

Initializes a new instance of the FieldValues class

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FieldValues(
	IList<ValueAtPoint> valueAtPoint
)
```
```vb
Public Sub New (
	valueAtPoint As IList(Of ValueAtPoint)
)
```
```cpp
public:
FieldValues(
	IList<ValueAtPoint^>^ valueAtPoint
)
```
```fsharp
new :
        valueAtPoint : IList<ValueAtPoint> -> FieldValues
```

#### Parameters

valueAtPoint IListValueAtPoint

#### Reference

FieldValues Class

FieldValues Overload

Autodesk.Revit.DB.Analysis Namespace